In [3]:
import pandas as pd
import numpy as np

In [2]:
arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(arr)
df

   0  1  2
0  1  2  3
1  4  5  6

In [3]:
df[2]
#3rd column

0    3
1    6
Name: 2, dtype: int32

In [5]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [7]:
arr1 = np.array([[2,4,6],[3,5,7]])
df1 = pd.DataFrame(arr1, columns = ['col1','col2','col3'])
df1

   col1  col2  col3
0     2     4     6
1     3     5     7

In [9]:
df1.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [10]:
df1['col2']

0    4
1    5
Name: col2, dtype: int32

# # data frame using series

In [11]:
s1 = pd.Series(np.random.randn(5),index = ['A','B','C','D','E'])
s2 = pd.Series(np.random.randn(5),index = ['A','B','C','D','E'])
s2

A    1.233686
B   -0.400221
C   -0.749444
D   -2.026801
E    0.013405
dtype: float64

In [13]:
df3 = pd.concat([s1,s2])
df3
#axis is 0 by default so row concatination

A    1.939196
B    1.236508
C    1.332747
D    0.278899
E    0.626436
A    1.233686
B   -0.400221
C   -0.749444
D   -2.026801
E    0.013405
dtype: float64

In [19]:
df4 = pd.concat([s1,s2],axis =1)
df4

          0         1
A  1.939196  1.233686
B  1.236508 -0.400221
C  1.332747 -0.749444
D  0.278899 -2.026801
E  0.626436  0.013405

In [22]:
df5 = df4.reset_index()
df5
# reset index to make another column for index

  index         0         1
0     A  1.939196  1.233686
1     B  1.236508 -0.400221
2     C  1.332747 -0.749444
3     D  0.278899 -2.026801
4     E  0.626436  0.013405

In [23]:
df5.iloc[0]

index           A
0        1.939196
1        1.233686
Name: 0, dtype: object

In [24]:
df5.iloc[0][1]

1.2336863967893772

In [25]:
s2

A    1.233686
B   -0.400221
C   -0.749444
D   -2.026801
E    0.013405
dtype: float64

In [26]:
s2.to_frame()
# to make df out of series immediately

          0
A  1.233686
B -0.400221
C -0.749444
D -2.026801
E  0.013405

In [4]:
my_df = pd.DataFrame(np.arange(25).reshape((5,5)),index=['a','b','c','d','e'], columns= ['A','B','C','D','E'])
my_df

    A   B   C   D   E
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [36]:
my_df.drop('b')

    A   B   C   D   E
a   0   1   2   3   4
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [38]:
my_df.drop('B',axis = 1)

    A   C   D   E
a   0   2   3   4
b   5   7   8   9
c  10  12  13  14
d  15  17  18  19
e  20  22  23  24

In [7]:
my_df.loc['a']

A    0
B    1
C    2
D    3
E    4
Name: a, dtype: int32

In [8]:
my_df.loc[:,'A']

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [9]:
my_df['A']

a     0
b     5
c    10
d    15
e    20
Name: A, dtype: int32

In [10]:
my_df['A']['b']

5

In [ ]:
my_df.loc['b','A']